if __name__ == "__main__":
    a = 7  # 111
    b = 4  # 100
    # นำแต่ละหลักมา and กัน เหมือนกันได้ 1 ต่างกันได้ 0
    print("a & b =", a & b)  # 100

    # นำแต่ละหลักมา or กัน
    print("a | b =", a | b)  # 111

    # นำแต่ละหลักมา xor กัน จะคืนค่า 1 ถ้าเฉพาะบิตใดบิตหนึ่งเป็น 1 แต่ไม่ทั้งสองบิต
    print("a ^ b =", a ^ b)  # 011

    # not (~) เป็นการกลับค่าบิตทั้งหมด (กลับจาก 1 เป็น 0 และจาก 0 เป็น 1)
    print("~a =", ~a)  # -(111 + 1) = -8

    # left shift เป็นการเลื่อนบิตไปทางซ้ายตามจำนวนที่กำหนด แต่ละการเลื่อนจะเท่ากับการคูณด้วย 2
    print("a << 1 =", a << 1)
    print("a << 2 =", a << 2)
    print("a << 3 =", a << 3)

    # right shift เป็นการเลื่อนบิตไปทางขวาตามจำนวนที่กำหนด แต่ละการเลื่อนจะเท่ากับการหารด้วย 2
    print("a >> 1 =", a >> 1)
    print("a >> 2 =", a >> 2)
    print("a >> 3 =", a >> 3)
